[
  {
    heading: 'Web Developer at Reelgood',
    subheading: 'March 2017 - March 2018',
    description: 'Reelgood keeps track of your favourite shows and streaming services that you\'re subscribed to. I was a member of Reelgood\'s web team for one year. I wrote React code that interacted with tens of APIs, handling user auth and email tokens, data loading, updating user preferences, and so on. I also wrote the playback mechanism. It\'s a library that takes the user\'s watched episodes and selected services and determines what streaming service to open on a given show when the user hits the play button.',
    slug: 'reelgood3',
    photoDescription: 'Reelgood - All your streaming services in one place.'
  },
  {
    heading: 'Junior Developer at Leanpub',
    subheading: 'April 2016 - December 2016',
    description: 'I spent eight months as a Junior developer at Ruboss, the Victoria-based company behind Leanpub. I wrote React and Ruby on Rails code for Leanpub and for individual client projects. This is where I cut my teeth on web development.',
    slug: 'reelgood2',
    photoDescription: 'Leanpub - A powerful platform for serious authors.'
  },
  {
    heading: '3rd Year B.Sc.',
    subheading: 'Mathematics & Computer Science',
    description: 'I\'m 12 courses away from a degree in Mathematics and Computer Science (combined single major) from UVic. I started at Thompson Rivers University in 2013 as Mathematics major, then transferred to UVic at the end of my 2nd year, and added a Computer Science component to my degree. I\'m most interested in applied mathematics and software engineering.',
    slug: 'leanpub',
    photoDescription: 'My courses.'
  },
  {
    heading: 'Event Organizer Extraordinaire',
    subheading: 'Global Game Jam, HackUVic, ResistJam',
    description: 'I\'ve organized a number of successful, sponsor-backed tech events in Victoria. I single-handedly ran Global Game Jam in January 2017 to great fanfare, revitalizing the UVic Game Dev club when club activity was waning. Immediately afterward, I helped the UVic WebDev Club put on HackUVic 2017, building out the website and getting sponsorship on their behalf. In 2018, I\'ve helped organize HackUVic 2018, putting my energy into the website, event design, and raising funds.',
    slug: 'leanpub',
    photoDescription: 'Working at Leanpub.'
  },
  {
    heading: 'The Interior',
    subheading: 'May 1994 - September 2015',
    description: 'I\'m from the North Shuswap, a tiny lakeside community in the BC Interior. Until I was 16 we had no high speed internet, and I would often go out into the woods to collect firewood or to hunt with my brothers and father. I worked on farms and did hedge trimming. I moved to Kamloops for school, and landscaped in the summers. On the third year, I split time between my employer and a side business doing hedge trimming and yard revivals. It was that summer that I had the idea to move to Victoria and try to strike out a living doing software development.',
    slug: 'reelgood2',
    photoDescription: 'My rusty, grey, fruitful Toyota.'
  },
  {
    heading: 'Web Developer at Reelgood',
    subheading: 'March 2017 - March 2018',
    description: 'This is me writing some bullshit and I hope that you read it while you\'re eating Panera and then you say \'oh wow this guy is definitely worth 50 bucks an hour\' and the truth is that I actually don\'t know what I\'m worth but I know I can make money doing this and probably you\'re either someone who needs web dev work or a developer.',
    slug: 'reelgood3',
    photoDescription: 'Working at Leanpub.'
  }
]
